Wikitutorials/tutorials/lagrangian/reactingParcelFoam/hotBoxes/0/wallFilmRegion/delta
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/wallFilmRegion";
    object      delta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    // top film surface
    "(.*top)"
    {
        type            zeroGradient;
    }

    // mapped boundaries
    "(region0_to.*)"
    {
        type            zeroGradient;
    }

    // floor sides
    walls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
